/*
                                                                                                    
   ad88888ba                                           88              88                           
  d8"     "8b  ,d                                      88              ""                           
  Y8,          88                                      88                                           
  `Y8aaaaa,  MM88MMM  ,adPPYYba,  8b,dPPYba,   ,adPPYb,88  8b,dPPYba,  88  8b       d8   ,adPPYba,  
    `"""""8b,  88     ""     `Y8  88P'   "Y8  a8"    `Y88  88P'   "Y8  88  `8b     d8'  a8P_____88  
          `8b  88     ,adPPPPP88  88          8b       88  88          88   `8b   d8'   8PP"""""""  
  Y8a     a8P  88,    88,    ,88  88          "8a,   ,d88  88          88    `8b,d8'    "8b,   ,aa  
   "Y88888P"   "Y888  `"8bbdP"Y8  88           `"8bbdP"Y8  88          88      "8"       `"Ybbd8"'  
                                                                                                    
  (c) Robin Southern 2017 https://github.com/betajaen/stardrive https://opensource.org/licenses/MIT 
                                                                                                    
*/

//! Basic Usage
//! https://github.com/betajaen/Stardrive/blob/master/Documentation/basic-usage.md
//! 
//! Cheat Sheet:
//! 
//! #include <Stardrive/Stardrive.h>    -- Header Files
//! 
//! #define SStardrive                  -- To a cpp file, only once!

#define SAssert(COND, REASON)             assert((COND) && REASON)
#define SEnsure(COND)                     assert(COND)
#define SAssertAlways(REASON)             assert(false && REASON)
#define SCompilerAssert(COND, REASON)     static_assert(COND, REASON)
#define SCompilerAssertSize(TYPE, SIZE)   static_assert(sizeof(TYPE) == (SIZE), "Unexpected size for " SToStr(TYPE) " expected " SToStr(SIZE) " bytes!")


//! Unit Testing
//! 
#if defined(STests)
  #define STestRuntime_DeclareSuite(NAME)                const char* STestSuite_##NAME();
  #define STestRuntime_Suite(NAME, ...)                  const char* STestSuite_##NAME() { const char* r = nullptr; __VA_ARGS__;  return nullptr; }
  #define STestRuntime_RunTest(NAME)                     do { r = STest_##NAME(); if (r != nullptr) { return r; } } while(0)
  #define STestRuntime(NAME, ...)                        static const char* STest_##NAME() { __VA_ARGS__; return nullptr; }
  #define STestRuntime_Equals(A, B)                      do { if ((A) != (B)) return SToStr(A) "==" SToStr(B); } while(0)
  #define STestRuntime_Equals_Reasoning(A, B, REASON)    do { if ((A) != (B)) return REASON; } while(0)
  #define STestRuntime_NotEquals(A, B)                   do { if ((A) == (B)) return SToStr(A) "!=" SToStr(B); } while(0)
  #define STestRuntime_NotEquals_Reasoning(A, B, REASON) do { if ((A) == (B)) return REASON; } while(0)
  #define STestCompiler(NAME, ...)                       namespace __VA_ARGS__
  #define STestCompiler_Equals(A, B, REASON)             static_assert((A) == (B), REASON)
#else
  #define STestRuntime_DeclareSuite(NAME)                
  #define STestRuntime_Suite(NAME, ...)                  
  #define STestRuntime_RunTest(NAME)                     
  #define STestRuntime(NAME, ...)                        
  #define STestRuntime_Equals(A, B)                      
  #define STestRuntime_Equals_Reasoning(A, B, REASON)    
  #define STestRuntime_NotEquals(A, B)                   
  #define STestRuntime_NotEquals_Reasoning(A, B, REASON) 
  #define STestCompiler(NAME, ...)                       
  #define STestCompiler_Equals(A, B, REASON)             
#endif



//! Documentation Macros
//! 
#define SMacroDoc(...)
#define STypeDoc(...)
#define SFunctionDoc(...)
#define SFieldDoc(...)
#define SConstructorDoc(...)
#define SDestructorDoc(...)
#define SRegionDoc(...)


//! Plain Old Data
//! https://github.com/betajaen/Stardrive/blob/master/Documentation/plain-old-data.md
//! 
//! Cheat Sheet:
//! 
//! Integers -- uinteger (size_t), integer (intptr_t)
//! Numbers  -- unsigned: u8, u16, u32, u64  signed: i8, i16, i32, i64
//! Floats   -- f32, f64
//! Boolean  -- bool, b32
//! Char     -- char8
namespace Stardrive {

  typedef size_t    uinteger; SCompilerAssert(sizeof(uinteger) == (SArchitecture / 8), "Uninteger is expected to match register size");
  typedef intptr_t  integer;  SCompilerAssert(sizeof(integer ) == (SArchitecture / 8), "Integer is expected to match register size");
  
  typedef uint8_t   byte;     SCompilerAssert(sizeof(byte  )   == 1, "Unexpected byte size. Should be 1 bytes.");
  typedef uint16_t  word;     SCompilerAssert(sizeof(word  )   == 2, "Unexpected word size. Should be 2 bytes.");
  typedef uint32_t  dword;    SCompilerAssert(sizeof(dword )   == 4, "Unexpected dword size. Should be 4 bytes.");
  typedef uint64_t  qword;    SCompilerAssert(sizeof(qword )   == 8, "Unexpected qword size. Should be 8 bytes.");
  typedef int8_t    sbyte;    SCompilerAssert(sizeof(sbyte )   == 1, "Unexpected sbyte size. Should be 1 bytes.");
  typedef int16_t   sword;    SCompilerAssert(sizeof(sword )   == 2, "Unexpected sword size. Should be 2 bytes.");
  typedef int32_t   sdword;   SCompilerAssert(sizeof(sdword)   == 4, "Unexpected sdword size. Should be 4 bytes.");
  typedef int64_t   sqword;   SCompilerAssert(sizeof(sqword)   == 8, "Unexpected sqword size. Should be 8 bytes.");

  typedef uint8_t   u8;       SCompilerAssert(sizeof(u8  )     == 1, "Unexpected u8 size. Should be 1 bytes.");
  typedef uint16_t  u16;      SCompilerAssert(sizeof(u16 )     == 2, "Unexpected u16 size. Should be 2 bytes.");
  typedef uint32_t  u32;      SCompilerAssert(sizeof(u32 )     == 4, "Unexpected u32 size. Should be 4 bytes.");
  typedef uint64_t  u64;      SCompilerAssert(sizeof(u64 )     == 8, "Unexpected u64 size. Should be 8 bytes.");
  typedef int8_t    i8;       SCompilerAssert(sizeof(i8  )     == 1, "Unexpected i8 size. Should be 1 bytes.");
  typedef int16_t   i16;      SCompilerAssert(sizeof(i16 )     == 2, "Unexpected i16 size. Should be 2 bytes.");
  typedef int32_t   i32;      SCompilerAssert(sizeof(i32 )     == 4, "Unexpected i32 size. Should be 4 bytes.");
  typedef int64_t   i64;      SCompilerAssert(sizeof(i64 )     == 8, "Unexpected i64 size. Should be 8 bytes.");

  typedef int32_t   b32;      SCompilerAssert(sizeof(b32)      == 4, "Unexpected b32 size. Should be 4 bytes.");
  typedef char      char8;    SCompilerAssert(sizeof(char8)    == 1, "Unexpected char8 size. Should be 1 byte.");

  typedef float     f32;      SCompilerAssert(sizeof(f32)      == 4, "Unexpected f32 size. Should be 4 bytes.");
  typedef double    f64;      SCompilerAssert(sizeof(f64)      == 8, "Unexpected f64 size. Should be 4 bytes.");

  #define SChar               char
  #define SSignedChar         signed char
  #define SShort              short
  #define SInt                int
  #define SLongLong           long long
  #define SUnsignedChar       unsigned char
  #define SUnsignedShort      unsigned short
  #define SUnsignedInt        unsigned int
  #define SUnsignedLongLong   unsigned long long
  #define SFloat              float
  #define SDouble             double

  template<typename T> struct numeric {};
  template<> struct numeric<u8>  { static const u8  Max = UINT8_MAX,  Min = 0;         };
  template<> struct numeric<u16> { static const u16 Max = UINT16_MAX, Min = 0;         };
  template<> struct numeric<u32> { static const u32 Max = UINT32_MAX, Min = 0;         };
  template<> struct numeric<u64> { static const u64 Max = UINT64_MAX, Min = 0;         };
